//快递点数据
var data = [
    {
      place: '菜鸟驿站(温职院生活区内优纳学驾中心)',
      lng: 120.7081930000,
      lat: 27.9308750000
    },
    {
      place: '天天快递(温大B区)',
      lng: 120.7067410000,
      lat: 27.9319120000
    }
];

//公寓数据
var ku = [
	{
		name: "温州市瓯海区温州职业技术学院茶山校区-初阳公寓",
		lng: 120.7089090000,
      	lat: 27.9300730000
	},
	{
		name: "温州市瓯海区温州职业技术学院茶山校区-朝阳公寓",
		lng: 120.7076330000,
      	lat: 27.9305310000
	},
	{
		name: "温州大学瓯江学院学生公寓B区9",
		lng: 120.7059970000,
      	lat: 27.9312620000
	},
	{
		name: "温州大学瓯江学院学生公寓B区2",
		lng: 120.7080260000,
      	lat: 27.9313150000
	}
]


var allOrder = [
	{
		id: 0,
		place: '温州市瓯海区温州职业技术学院茶山校区-初阳公寓',
		lng: 120.7089090000,
      	lat: 27.9300730000,
      	num: 920,
      	distance: 1,
      	time: '2015-11-3 12:24 前'
	},
	{
		id: 1,
		place: '温州市瓯海区温州职业技术学院茶山校区-初阳公寓',
		lng: 120.7089090000,
      	lat: 27.9300730000,
      	num: 919,
      	distance: 2,
      	time: '2017-11-3 21:24 整'
	},
	{
		id: 2,
		place: '温州市瓯海区温州职业技术学院茶山校区-初阳公寓',
		lng: 120.7089090000,
      	lat: 27.9300730000,
      	num: 921,
      	distance: 2,
      	time: '2013-11-3 12:24 前'
	},
	{
		id: 3,
		place: '温州市瓯海区温州职业技术学院茶山校区-朝阳公寓',
		lng: 120.7076330000,
      	lat: 27.9305310000,
      	num: 802,
      	distance: 3,
      	time: '2015-10-3 19:24 整'
	},
	{
		id: 4,
		place: '温州市瓯海区温州职业技术学院茶山校区-朝阳公寓',
		lng: 120.7076330000,
      	lat: 27.9305310000,
      	num: 801,
      	distance: 1,
      	time: '2015-11-3 10:24 前'
	},
	{
		id: 5,
		place: '温州大学瓯江学院学生公寓B区2',
		lng: 120.7080260000,
      	lat: 27.9313150000,
      	num: 456,
      	distance: 2,
      	time: '2015-11-3 11:24 整'
	},
	{
		id: 6,
		place: '温州大学瓯江学院学生公寓B区9',
		lng: 120.7059970000,
      	lat: 27.9312620000,
      	num: 545,
      	distance: 3,
      	time: '2015-10-3 20:24 整'
	},
	{
		id: 7,
		place: '温州大学瓯江学院学生公寓B区2',
		lng: 120.7080260000,
      	lat: 27.9313150000,
      	num: 426,
      	distance: 1,
      	time: '2015-5-3 12:24 前'
	},
	{
		id: 8,
		place: '温州大学瓯江学院学生公寓B区9',
		lng: 120.7059970000,
      	lat: 27.9312620000,
      	num: 523,
      	distance: 2,
      	time: '2015-10-3 19:24 前'
	}
];
